package com.zavoloka.repository;

import com.zavoloka.model.Game;

public interface GameRepository {

    int save(Game game);
    Game getById(int id);
    void deleteAll();
}
/*Інтерфейс GameRepository визначає контракт для репозиторію гри, в якому описані основні операції для зберігання та
отримання інформації про гру:

Метод save(Game game):

Призначений для збереження об'єкта Game в репозиторії. Повертає ідентифікатор, який може використовуватись для
подальшого отримання чи взаємодії з збереженою грою.
Метод getById(int id):

Повертає об'єкт Game за його ідентифікатором. Якщо гра з зазначеним ідентифікатором не знайдена, повертає null або
генерує виняток.
Метод deleteAll():

Видаляє всі збережені гри з репозиторію. Цей метод може використовуватись для очищення репозиторію перед початком нового
етапу гри чи іншими подібними сценаріями.
Цей інтерфейс визначає базовий набір операцій, які повинен реалізовувати будь-який конкретний клас, що виконує роль
репозиторію гри. Користуючись цим інтерфейсом, ви можете створювати різні реалізації репозиторію, наприклад, для роботи
з різними системами зберігання даних (наприклад, базою даних, пам'яттю, тощо).*/