package com.zavoloka.resolver;

import com.zavoloka.model.Question;

public interface Resolver {

	void resolveAndSetStatus(Question question);
}
/*
Визначення Статусу Питань:

Основна задача цього інтерфейсу полягає в визначенні та встановленні статусу для об'єкта Question. Це може включати в себе різні стратегії вирішення, такі як більшість голосів, часові обмеження або інші критерії.
Абстрагування Логіки Рішення:

Інтерфейс служить як абстракція для логіки рішення, що дозволяє вам додавати різні реалізації для визначення статусу питань. Ви можете мати кілька реалізацій, які використовують різні стратегії або алгоритми.
Легка Розширюваність:

Завдяки цьому інтерфейсу можна легко додавати нові класи резольверів без змінення клієнтського коду. Це робить систему більш гнучкою і легше розширюваною.
Спрощення Тестування:

Інтерфейс дозволяє легко створювати заміни (mocks або stubs) для резольверів під час тестування. Це полегшує ізоляцію різних частин системи для тестування.
Розділення Відповідальностей:

Розділення логіки визначення статусу питань від інших частин системи допомагає утримувати код чистим і добре організованим. Виокремлення цієї відповідальності дозволяє краще управляти змінами та розширеннями.
Кожен клас, який реалізує цей інтерфейс, відповідає за конкретну стратегію чи логіку визначення статусу питань.*/