package com.zavoloka.dto;

public class GameExceptionResponseDto {

	private String message;

	public GameExceptionResponseDto(String message) {
		super();
		this.message = message;
	}

	public String getMessage() {
		return message;
	}
}
/*
Це клас GameExceptionResponseDto, і його роль та функції в проекті можна визначити наступним чином:

Роль в проекті:

Повідомлення про помилку: Клас служить для упаковки інформації про помилку, яку можна передати між різними частинами
програми або між сервером та клієнтом.

Функції класу:

Конструктор: Клас має конструктор, який дозволяє створювати об'єкти класу з переданим повідомленням про помилку.
Гетер для повідомлення: Забезпечує гетер для отримання повідомлення про помилку з об'єкта.
Цей клас використовується для передачі інформації про помилку між різними частинами програми або між сервером та
клієнтом, використовуючи об'єкт у форматі DTO.*/